In [10]:
# import libraries
import pandas as pd

# create a dataframe

lst = [['a', 'b', 'c', 'j'], ['d', 'e', 'f', 'k'], ['g', 'h', 'i', 'l']]

# create dataframe with column name
df = pd.DataFrame(columns= ['one', 'two', 'three', 'four'], data=lst)

df.head()

  one two three four
0   a   b     c    j
1   d   e     f    k
2   g   h     i    l

In [ ]:
# extract column
df['one']

0    a
1    d
2    g
Name: one, dtype: object

In [4]:
# extract multiple column
df[['one', 'two']]

  one two
0   a   b
1   d   e
2   g   h

In [7]:
# specify the range of rows, with all columns

df[1:3]

  one two three four
1   d   e     f    k
2   g   h     i    l

**Using `loc`, `iloc`, `ix`**

### Label based Selection: `loc`

`loc` method uses the label of the rows and columns to select the required data.
Imagine that you have a table with people and their personal information. This table might contain their name, age, sex, etc. You need to find information about a person, "Peter." To do this, you look at the column marked "name," and then scroll until you find the particular person's name. Then you want to get all the information in his corresponding row.

In the dataframe we have created, let us try to simulate this by supposing that we want the information about the entry, which has a value of "f" in the column marked "two."

To do this, first, we tell Pandas about our column of interest. We use the
`df.set_index()` command to do it.

Then we use the `.loc` method to find the row that contains the information we want.

In [11]:
df.set_index('four', inplace= True)
df.head()

     one two three
four
j      a   b     c
k      d   e     f
l      g   h     i

In [ ]:
df.loc['k'] # extracts single row corresponding to the label specified.

one      d
two      e
three    f
Name: k, dtype: object

In [16]:
df.loc[['j', 'l']] # For multiple rows extraction

     one two three
four
j      a   b     c
l      g   h     i

In [18]:
# Selecting both rows and columns

df.loc[['k', 'l'], ['one', 'two']]

     one two
four
k      d   e
l      g   h

In [20]:
import pandas as pd

name_list = ['Ford', 'Ferrari', 'Lamborghini', 'Toyota']
shift_list = [1,1,1,0]
color_list = ['red', 'blue', 'white', 'white']
door_list = [4,2,2,4]

#create dataframe
df1 = pd.DataFrame(data={'Company':name_list,
                        'Automatic shift':shift_list,
                        'Color':color_list,
                        'Number of doors':door_list})


df1.head()

       Company  Automatic shift  Color  Number of doors
0         Ford                1    red                4
1      Ferrari                1   blue                2
2  Lamborghini                1  white                2
3       Toyota                0  white                4

In [25]:
df1.iloc[3]["Color"]

'white'

### Index based Selection - `iloc`
The `iloc` command for Pandas Dataframe stands for **integer-location(iloc)**. It selects the row and column based on the position.



```
df.iloc[<row selection>, <column selection>]
```
`iloc` in Pandas selects rows and columns by number, in the order that they appear in the data frame. You can imagine that each row has a row number from 0 to the total rows, and `iloc[]` allows selections based on these numbers. The same applies to columns.

For example, in the dataframe above, suppose we want to select the letter 'g'. It is in the second row and third column. However, remember that in programming, we start counting from zero. So, this means that it is on row `1` and column `2`.

We would use the command `df.iloc[1,2]` to access the letter.

In [26]:
# retrieving rows by iloc method
df1.iloc[2]

Company            Lamborghini
Automatic shift              1
Color                    white
Number of doors              2
Name: 2, dtype: object

In [27]:
# retrieving a specific element with both row and column
df1.iloc[1, 2]

'blue'

In [33]:
df1.iloc[1:2, 0:2]

   Company  Automatic shift
1  Ferrari                1

In [35]:
df1.iloc[0: 5, 0:2]

       Company  Automatic shift
0         Ford                1
1      Ferrari                1
2  Lamborghini                1
3       Toyota                0

### Selecting data using `ix`

The `ix` operator is deprecated in the recent version of Pandas. `ix` is a hybrid form of `loc` and `iloc`. `ix` is a label-based operator and acts just as the `.loc` indexer. `ix` also supports integer type selections (as .iloc) where passed an integer.

This only works where the index of the DataFrame is not integer-based. Any form of input, i.e., `.loc` and `.iloc` is accepted by `ix`.

In [36]:
df1.ix[1:2, 'Company'] # outputs elements of row 1 and row 2 which fall under the 'three' column

AttributeError: 'DataFrame' object has no attribute 'ix'

It is because i have not upgraded my python version.